# 4) ცვლადის განახლება ოპერატორებით (+, -, *, /)
x = 10
x += 5
x -= 3
x *= 2
x /= 4

# 5) 10-10 მაგალითი თითო ოპერატორისთვის
x = 10
x += 1; x += 2; x += 3; x += 4; x += 5; x += 6; x += 7; x += 8; x += 9; x += 10
x -= 1; x -= 2; x -= 3; x -= 4; x -= 5; x -= 6; x -= 7; x -= 8; x -= 9; x -= 10
x *= 1; x *= 2; x *= 3; x *= 4; x *= 5; x *= 6; x *= 7; x *= 8; x *= 9; x *= 10
x /= 1; x /= 2; x /= 3; x /= 4; x /= 5; x /= 6; x /= 7; x /= 8; x /= 9; x /= 10
x %= 1; x %= 2; x %= 3; x %= 4; x %= 5; x %= 6; x %= 7; x %= 8; x %= 9; x %= 10
x **= 1; x **= 2; x **= 3; x **= 4; x **= 5; x **= 6; x **= 7; x **= 8; x **= 9; x **= 10

# 7) ერთი ცვლადი მნიშვნელობის შეცვლით
y = 5
y += 3
y *= 2
y -= 4
y /= 3
y **= 2
print(y)
