

// შექმენით ინტერვალი, რომელიც ფუნქციას გამოიძახებს ყოველ 10 წამში. ამ ფუნქციამ უნდა დაბეჭდოს თქვენი სახელი, გვარი.

// როდესაც მომხმარებელი დააკლიკებს ღილაკს, ეს ინტერვალი უნდა გაუქმდეს


let timer=setInterval(func, 10000)
function func(){
    console.log("aleqsandre wowkolauri")
}




// შეადგინეთ კონსტანტა და მასში შეინახეთ მასივი. ამ მასივში უნდა გქონდეთ სთრინგი, რიცხვი, ბულეანი, ობიექტი და მასივი.

// საბოლოოდ დაბეჭდეთ ეს მასივი

const myArr=["string", 5, true, Date]
console.log (myArr)


// შექმენით ერთი ფუნქცია, სახელად travserseArr, რომელსაც ექნება ერთი პარამეტრი (ამ პარამეტრში შეინახება მასივი). ფუნქციის კოდის ბლოკი ისე დაწერეთ, რომ ციკლით გადაუაროთ მასივს და დაბეჭდოთ მისი ყველა ელემენტი.

// ფუნქცია გამოიძახეთ ორჯერ, არგუმენტად გაუწერეთ განსხვავებული მასივები

function travserseArr(arr){
    for(let i=0; i<arr.length){
        console.log(arr[i])
    }
}

travserseArr([1,2,3,4])
travserseArr([5,6,8,4])